README.org
**** Fonts

#+BEGIN_SRC emacs-lisp :tangle config.el
(after! org-faces
  (defun org-colors-dracula ()
    "Enable Dracula colors for Org headers."
    (interactive)
    (dolist
        (face
         '((org-level-1 1.7 "#8be9fd" ultra-bold)
           (org-level-2 1.6 "#bd93f9" extra-bold)
           (org-level-3 1.5 "#50fa7b" bold)
           (org-level-4 1.4 "#ff79c6" semi-bold)
           (org-level-5 1.3 "#9aedfe" normal)
           (org-level-6 1.2 "#caa9fa" normal)
           (org-level-7 1.1 "#5af78e" normal)
           (org-level-8 1.0 "#ff92d0" normal)))
      (set-face-attribute (nth 0 face) nil :font doom-variable-pitch-font :weight (nth 3 face) :height (nth 1 face) :foreground (nth 2 face)))
    (set-face-attribute 'org-table nil :font doom-font :weight 'normal :height 1.0 :foreground "#bfafdf"))
  ;; Load our desired org-colors-* theme on startup
  (org-colors-dracula))
#+END_SRC

**** Superstar

#+BEGIN_SRC emacs-lisp :tangle config.el
(setq org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆"))
(setq org-superstar-item-bullet-alist '((?+ . ?➤) (?- . ?✦))) ; changes +/- symbols in item lists
(add-hook! org-mode (org-superstar-mode))
#+END_SRC

*** Markdown

#+BEGIN_SRC emacs-lisp :tangle config.el
(custom-set-faces
 '(markdown-header-face ((t (:inherit font-lock-function-name-face :weight bold :family "variable-pitch"))))
 '(markdown-header-face-1 ((t (:inherit markdown-header-face :height 1.8))))
 '(markdown-header-face-2 ((t (:inherit markdown-header-face :height 1.4))))
 '(markdown-header-face-3 ((t (:inherit markdown-header-face :height 1.2)))))
#+END_SRC

*** Projectile

#+BEGIN_SRC emacs-lisp :tangle config.el
(setq projectile-project-search-path '("~/Projects/Personal/" "~/Projects/System/" "~/.config/"))
#+END_SRC

*** Prettier Formatter

#+BEGIN_SRC emacs-lisp :tangle config.el
(add-hook! 'web-mode-hook 'prettier-js-mode)
#+END_SRC

*** CDLaTeX

#+BEGIN_SRC emacs-lisp :tangle config.el
(map! :map cdlatex-mode-map
    :i "TAB" #'cdlatex-tab)
#+END_SRC

*** File Extension Mode Association

#+BEGIN_SRC emacs-lisp :tangle config.el
(add-to-list 'auto-mode-alist '("\\.m\\'" . octave-mode))
#+END_SRC

*** Automatically Revert Buffers For Changed Files

Revert buffers when the underlying file has changed

#+BEGIN_SRC emacs-lisp :tangle config.el
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
#+END_SRC

*** Rainbow Mode

#+BEGIN_SRC emacs-lisp :tangle config.el
(define-globalized-minor-mode global-rainbow-mode rainbow-mode
  (lambda () (rainbow-mode 1)))
(global-rainbow-mode 1)
#+END_SRC

*** Debugging

**** Keybindings

#+BEGIN_SRC emacs-lisp :tangle config.el
(map! :map dap-mode-map
      :leader
      :prefix ("d" . "dap")
      ;; basics
      :desc "dap next"          "n" #'dap-next
      :desc "dap step in"       "i" #'dap-step-in
      :desc "dap step out"      "o" #'dap-step-out
      :desc "dap continue"      "c" #'dap-continue
      :desc "dap hydra"         "h" #'dap-hydra
      :desc "dap debug restart" "r" #'dap-debug-restart
      :desc "dap debug"         "s" #'dap-debug

      ;; debug
      :prefix ("dd" . "Debug")
      :desc "dap debug recent"  "r" #'dap-debug-recent
      :desc "dap debug last"    "l" #'dap-debug-last

      ;; eval
      :prefix ("de" . "Eval")
      :desc "eval"                "e" #'dap-eval
      :desc "eval region"         "r" #'dap-eval-region
      :desc "eval thing at point" "s" #'dap-eval-thing-at-point
      :desc "add expression"      "a" #'dap-ui-expressions-add
      :desc "remove expression"   "d" #'dap-ui-expressions-remove

      :prefix ("db" . "Breakpoint")
      :desc "dap breakpoint toggle"      "b" #'dap-breakpoint-toggle
      :desc "dap breakpoint condition"   "c" #'dap-breakpoint-condition
      :desc "dap breakpoint hit count"   "h" #'dap-breakpoint-hit-condition
      :desc "dap breakpoint log message" "l" #'dap-breakpoint-log-message)
#+END_SRC

**** Python

#+BEGIN_SRC emacs-lisp :tangle config.el
(after! dap-mode
  (setq dap-python-debugger 'debugpy))
#+END_SRC

** packages.el

To install a package with Doom you must declare them here and run =doom sync= on the command line, then restart Emacs for the changes to take effect -- or use =M-x doom/reload=.

To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:

#+BEGIN_EXAMPLE
(package! some-package)
#+END_EXAMPLE

To install a package directly from a remote git repo, you must specify a =:recipe=. You'll find documentation on what =:recipe= accepts here: https://github.com/raxod502/straight.el#the-recipe-format

#+BEGIN_EXAMPLE
(package! another-package
  :recipe (:host github :repo "username/repo"))
#+END_EXAMPLE

If the package you are trying to install does not contain a PACKAGENAME.el file, or is located in a subdirectory of the repo, you'll need to specify =:files= in the =:recipe=:

#+BEGIN_EXAMPLE
(package! this-package
  :recipe (:host github :repo "username/repo"
           :files ("some-file.el" "src/lisp/*.el")))
#+END_EXAMPLE

If you'd like to disable a package included with Doom, you can do so here with the =:disable= property:

#+BEGIN_EXAMPLE
(package! builtin-package :disable t)
#+END_EXAMPLE

You can override the recipe of a built in package without having to specify all the properties for =:recipe=. These will inherit the rest of its recipe from Doom or MELPA/ELPA/Emacsmirror:

#+BEGIN_EXAMPLE
(package! builtin-package :recipe (:nonrecursive t))
(package! builtin-package-2 :recipe (:repo "myfork/package"))
#+END_EXAMPLE

Specify a =:branch= to install a package from a particular branch or tag. This is required for some packages whose default branch isn't =master= (which our package manager can't deal with; see raxod502/straight.el#279)

#+BEGIN_EXAMPLE
(package! builtin-package :recipe (:branch "develop"))
#+END_EXAMPLE

Use =:pin= to specify a particular commit to install.

#+BEGIN_EXAMPLE
(package! builtin-package :pin "1a2b3c4d5e")
#+END_EXAMPLE

Doom's packages are pinned to a specific commit and updated from release to release. The =unpin!= macro allows you to unpin single packages...

#+BEGIN_EXAMPLE
(unpin! pinned-package)
#+END_EXAMPLE

...or multiple packages

#+BEGIN_EXAMPLE
;(unpin! pinned-package another-pinned-package)
#+END_EXAMPLE

...Or *all* packages (NOT RECOMMENDED; will likely break things)

#+BEGIN_EXAMPLE
;(unpin! t)
#+END_EXAMPLE

#+BEGIN_SRC emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+END_SRC

*** Packages

#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! org-auto-tangle)
(package! git-modes)
(package! vimrc-mode)
(package! prettier-js)
(package! rainbow-mode)
(package! systemd)
(package! pkgbuild-mode)
(package! lua-mode)
#+END_SRC
